# JPerMSup2K Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..JPerMSup2K Property
SymbolTypeId Class See Also
---
Symbol J/(m²·K), indicating unit Joules per square meter Kelvin.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId JPerMSup2K { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property JPerMSup2K As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ JPerMSup2K {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace